bluecats/zephyr/drivers/spi/spi_ll_stm32_preparation_for_blck_chained_dma.c
	int i;

	for(i=0;i<rx_bufs->count && i<8;i++) {
		data->b[RX_STREAM][i].dest_address = (u32_t)rx_bufs->buffers[i].buf;
		data->b[RX_STREAM][i].block_size = rx_bufs->buffers[i].len;
		data->b[RX_STREAM][i].source_address = (u32_t)&(SPI6->DR);
		data->b[RX_STREAM][i].source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		data->b[RX_STREAM][i].dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		data->nDMA++;
	}
	data->dma_conf[RX_STREAM].block_count = i;

	for(i=0;i<tx_bufs->count && i<8;i++) {
		data->b[TX_STREAM][i].source_address = (u32_t)tx_bufs->buffers[i].buf;
		data->b[TX_STREAM][i].block_size = tx_bufs->buffers[i].len;
		data->b[TX_STREAM][i].dest_address = (u32_t)&(SPI6->DR);
		data->b[TX_STREAM][i].source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		data->b[TX_STREAM][i].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		data->nDMA++;
	}
	data->dma_conf[TX_STREAM].block_count = i;

	if (spi_context_rx_on(&data->ctx)) {
		// data->b[RX_STREAM].dest_address = (u32_t)data->ctx.rx_buf;
		// data->b[RX_STREAM].block_size = data->ctx.rx_len;
		// data->nDMA++;

		ret = dma_config(data->d, cfg->stream[RX_STREAM],
				&data->dma_conf[RX_STREAM]);
		if (ret) {
			LOG_ERR("Failed to configure RX_STREAM");
			return ret;
		}

		LL_SPI_EnableDMAReq_RX(spi);
		dma_start(data->d, cfg->stream[RX_STREAM]);
	}

	if (spi_context_tx_on(&data->ctx)) {
		// data->b[TX_STREAM].source_address = (u32_t)data->ctx.tx_buf;
		// data->b[TX_STREAM].block_size = data->ctx.tx_len;
		// data->nDMA++;

		ret = dma_config(data->d, cfg->stream[TX_STREAM],
					&data->dma_conf[TX_STREAM]);
		if (ret) {
			LOG_ERR("Failed to configure TX_STREAM");
			return ret;
		}

		LL_SPI_EnableDMAReq_TX(spi);
		dma_start(data->d, cfg->stream[TX_STREAM]);
	}

	/* Everything is now set, spin the plates, assuming */
	/* we're not waiting for a trigger later */
	if (!SPI_DEFER_GET(config->operation)) {
		LL_SPI_Enable(spi);
	} else   {
		data->armed = true;
	}

	/* Now just wait for it to complete, or an error */
	ret = spi_context_wait_for_completion(&data->ctx);

#elif defined(CONFIG_SPI_STM32_INTERRUPT)
	/* Else perform Interrupt based transfer activity */
	LL_SPI_EnableIT_ERR(spi);

	if (rx_bufs) {
		LL_SPI_EnableIT_RXNE(spi);
	}

	LL_SPI_EnableIT_TXE(spi);
	LL_SPI_Enable(spi);

	ret = spi_context_wait_for_completion(&data->ctx);
#else
	/* Else perform programmed transfer based transfer activity */
	LL_SPI_Enable(spi);
	do {
		ret = spi_stm32_shift_frames(spi, data);
	} while (!ret && spi_stm32_transfer_ongoing(data));

	spi_stm32_complete(data, spi, ret);

#ifdef CONFIG_SPI_SLAVE
	if (spi_context_is_slave(&data->ctx) && !ret) {
		ret = data->ctx.recv_frames;
	}
#endif  /* CONFIG_SPI_SLAVE */

#endif

	spi_context_release(&data->ctx, ret);

	return ret;
}

static int spi_stm32_transceive(struct device *dev,
				const struct spi_config *config,
				const struct spi_buf_set *tx_bufs,
				const struct spi_buf_set *rx_bufs)
{
	return transceive(dev, config, tx_bufs, rx_bufs, false, NULL);
}

static int spi_stm32_trigger(struct device *dev,
			     const struct spi_config *config)

{
	const struct spi_stm32_config *cfg = DEV_CFG(dev);
	struct spi_stm32_data *data = DEV_DATA(dev);
	SPI_TypeDef *spi = cfg->spi;

	if ((!SPI_DEFER_GET(config->operation)) || (!data->armed)) {
		return -EBUSY;
	}

	data->armed = false;
	LL_SPI_Enable(spi);
	return 0;
}

#ifdef CONFIG_SPI_ASYNC
static int spi_stm32_transceive_async(struct device *dev,
				      const struct spi_config *config,
				      const struct spi_buf_set *tx_bufs,
				      const struct spi_buf_set *rx_bufs,
				      struct spi_async_event *async)
{
	return transceive(dev, config, tx_bufs, rx_bufs, true, async);
}
#endif /* CONFIG_SPI_ASYNC */

static const struct spi_driver_api api_funcs = {
	.transceive = spi_stm32_transceive,
#ifdef CONFIG_SPI_ASYNC
	.transceive_async = spi_stm32_transceive_async,
#endif
	.release = spi_stm32_release,
	.trigger = spi_stm32_trigger
};

static int spi_stm32_init(struct device *dev)
{
	struct spi_stm32_data *data __attribute__((unused)) = dev->driver_data;
	const struct spi_stm32_config *cfg = dev->config->config_info;

	__ASSERT_NO_MSG(device_get_binding(STM32_CLOCK_CONTROL_NAME));

#ifdef CONFIG_SPI_STM32_DMA
	data->dma_conf[RX_STREAM].callback_arg = dev;
	data->dma_conf[TX_STREAM].callback_arg = dev;
	data->d = device_get_binding(cfg->dmadev);
#endif

	if (clock_control_on(device_get_binding(STM32_CLOCK_CONTROL_NAME),
			       (clock_control_subsys_t) &cfg->pclken) != 0) {
		LOG_ERR("Could not enable SPI clock");
		return -EIO;
	}

#ifdef CONFIG_SPI_STM32_INTERRUPT
	cfg->irq_config(dev);
#endif

	spi_context_unlock_unconditionally(&data->ctx);

	return 0;
}

#ifdef CONFIG_SPI_1

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_1(struct device *port);
#endif

static const struct spi_stm32_config spi_stm32_cfg_1 = {
	.spi = (SPI_TypeDef *) DT_SPI_1_BASE_ADDRESS,
	.pclken = {
		.enr = DT_SPI_1_CLOCK_BITS,
		.bus = DT_SPI_1_CLOCK_BUS
	},
#ifdef CONFIG_SPI_STM32_INTERRUPT
	.irq_config = spi_stm32_irq_config_func_1,
#endif

#ifdef CONFIG_SPI_STM32_DMA
	.stream[TX_STREAM] = 3,
	.stream[RX_STREAM] = 2,
	.dmadev = CONFIG_DMA_2_NAME,
#endif
};

static struct spi_stm32_data spi_stm32_dev_data_1 = {
	SPI_CONTEXT_INIT_LOCK(spi_stm32_dev_data_1, ctx),
	SPI_CONTEXT_INIT_SYNC(spi_stm32_dev_data_1, ctx),

#ifdef CONFIG_SPI_STM32_DMA
	// /* Transmit block config */
	// .b[TX_STREAM].dest_address = (u32_t)&(SPI1->DR),
	// .b[TX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[TX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	// /* Receive block config */
	// .b[RX_STREAM].source_address = (u32_t)&(SPI1->DR),
	// .b[RX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[RX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	/* Setup for transmit stream */
	.dma_conf[TX_STREAM].dma_slot = 3,
	.dma_conf[TX_STREAM].channel_direction = MEMORY_TO_PERIPHERAL,
	.dma_conf[TX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[TX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[TX_STREAM].source_burst_length = 0,
	.dma_conf[TX_STREAM].dest_burst_length = 0,
	.dma_conf[TX_STREAM].dma_callback = dmaCallback,
	.dma_conf[TX_STREAM].complete_callback_en = 1,
	.dma_conf[TX_STREAM].error_callback_en = 1,
	.dma_conf[TX_STREAM].head_block = &spi_stm32_dev_data_1.b[TX_STREAM][0],

