bluecats/zephyr/drivers/spi/spi_ll_stm32_preparation_for_blck_chained_dma.c
	/* Setup for receive stream */
	.dma_conf[RX_STREAM].dma_slot = 3,
	.dma_conf[RX_STREAM].channel_direction = PERIPHERAL_TO_MEMORY,
	.dma_conf[RX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[RX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[RX_STREAM].source_burst_length = 0,
	.dma_conf[RX_STREAM].dest_burst_length = 0,
	.dma_conf[RX_STREAM].dma_callback = dmaCallback,
	.dma_conf[RX_STREAM].complete_callback_en = 1,
	.dma_conf[RX_STREAM].error_callback_en = 1,
	.dma_conf[RX_STREAM].head_block = &spi_stm32_dev_data_1.b[RX_STREAM][0],
#endif
};

DEVICE_AND_API_INIT(spi_stm32_1, DT_SPI_1_NAME, &spi_stm32_init,
		    &spi_stm32_dev_data_1, &spi_stm32_cfg_1,
		    POST_KERNEL, CONFIG_SPI_INIT_PRIORITY,
		    &api_funcs);

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_1(struct device *dev)
{
	IRQ_CONNECT(DT_SPI_1_IRQ, DT_SPI_1_IRQ_PRI,
		    spi_stm32_isr, DEVICE_GET(spi_stm32_1), 0);
	irq_enable(DT_SPI_1_IRQ);
}
#endif

#endif /* CONFIG_SPI_1 */

#ifdef CONFIG_SPI_2

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_2(struct device *port);
#endif

static const struct spi_stm32_config spi_stm32_cfg_2 = {
	.spi = (SPI_TypeDef *) DT_SPI_2_BASE_ADDRESS,
	.pclken = {
		.enr = DT_SPI_2_CLOCK_BITS,
		.bus = DT_SPI_2_CLOCK_BUS
	},
#ifdef CONFIG_SPI_STM32_INTERRUPT
	.irq_config = spi_stm32_irq_config_func_2,
#endif

#ifdef CONFIG_SPI_STM32_DMA
	.stream[TX_STREAM] = 4,
	.stream[RX_STREAM] = 3,
	.dmadev = CONFIG_DMA_1_NAME,
#endif
};

static struct spi_stm32_data spi_stm32_dev_data_2 = {
	SPI_CONTEXT_INIT_LOCK(spi_stm32_dev_data_2, ctx),
	SPI_CONTEXT_INIT_SYNC(spi_stm32_dev_data_2, ctx),

#ifdef CONFIG_SPI_STM32_DMA
	// /* Transmit block config */
	// .b[TX_STREAM].dest_address = (u32_t)&(SPI2->DR),
	// .b[TX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[TX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	// /* Receive block config */
	// .b[RX_STREAM].source_address = (u32_t)&(SPI2->DR),
	// .b[RX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[RX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	/* Setup for transmit stream */
	.dma_conf[TX_STREAM].dma_slot = 0,
	.dma_conf[TX_STREAM].channel_direction = MEMORY_TO_PERIPHERAL,
	.dma_conf[TX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[TX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[TX_STREAM].source_burst_length = 0,
	.dma_conf[TX_STREAM].dest_burst_length = 0,
	.dma_conf[TX_STREAM].dma_callback = dmaCallback,
	.dma_conf[TX_STREAM].head_block = &spi_stm32_dev_data_2.b[TX_STREAM][0],

	/* Setup for receive stream */
	.dma_conf[RX_STREAM].dma_slot = 0,
	.dma_conf[RX_STREAM].channel_direction = PERIPHERAL_TO_MEMORY,
	.dma_conf[RX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[RX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[RX_STREAM].source_burst_length = 0,
	.dma_conf[RX_STREAM].dest_burst_length = 0,
	.dma_conf[RX_STREAM].dma_callback = dmaCallback,
	.dma_conf[RX_STREAM].head_block = &spi_stm32_dev_data_2.b[RX_STREAM][0],
#endif
};

DEVICE_AND_API_INIT(spi_stm32_2, DT_SPI_2_NAME, &spi_stm32_init,
		    &spi_stm32_dev_data_2, &spi_stm32_cfg_2,
		    POST_KERNEL, CONFIG_SPI_INIT_PRIORITY,
		    &api_funcs);

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_2(struct device *dev)
{
	IRQ_CONNECT(DT_SPI_2_IRQ, DT_SPI_2_IRQ_PRI,
		    spi_stm32_isr, DEVICE_GET(spi_stm32_2), 0);
	irq_enable(DT_SPI_2_IRQ);
}
#endif

#endif /* CONFIG_SPI_2 */

#ifdef CONFIG_SPI_3

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_3(struct device *port);
#endif

static const  struct spi_stm32_config spi_stm32_cfg_3 = {
	.spi = (SPI_TypeDef *) DT_SPI_3_BASE_ADDRESS,
	.pclken = {
		.enr = DT_SPI_3_CLOCK_BITS,
		.bus = DT_SPI_3_CLOCK_BUS
	},
#ifdef CONFIG_SPI_STM32_INTERRUPT
	.irq_config = spi_stm32_irq_config_func_3,
#endif

#ifdef CONFIG_SPI_STM32_DMA
	.stream[TX_STREAM] = 2,
	.stream[RX_STREAM] = 0,
	.dmadev = CONFIG_DMA_1_NAME,
#endif
};

static struct spi_stm32_data spi_stm32_dev_data_3 = {
	SPI_CONTEXT_INIT_LOCK(spi_stm32_dev_data_3, ctx),
	SPI_CONTEXT_INIT_SYNC(spi_stm32_dev_data_3, ctx),
#ifdef CONFIG_SPI_STM32_DMA
	// /* Transmit block config */
	// .b[TX_STREAM].dest_address = (u32_t)&(SPI3->DR),
	// .b[TX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[TX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	// /* Receive block config */
	// .b[RX_STREAM].source_address = (u32_t)&(SPI3->DR),
	// .b[RX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[RX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	/* Setup for transmit stream */
	.dma_conf[TX_STREAM].dma_slot = 0,
	.dma_conf[TX_STREAM].channel_direction = MEMORY_TO_PERIPHERAL,
	.dma_conf[TX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[TX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[TX_STREAM].source_burst_length = 0,
	.dma_conf[TX_STREAM].dest_burst_length = 0,
	.dma_conf[TX_STREAM].dma_callback = dmaCallback,
	.dma_conf[TX_STREAM].head_block = &spi_stm32_dev_data_3.b[TX_STREAM][0],

	/* Setup for receive stream */
	.dma_conf[RX_STREAM].dma_slot = 0,
	.dma_conf[RX_STREAM].channel_direction = PERIPHERAL_TO_MEMORY,
	.dma_conf[RX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[RX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[RX_STREAM].source_burst_length = 0,
	.dma_conf[RX_STREAM].dest_burst_length = 0,
	.dma_conf[RX_STREAM].dma_callback = dmaCallback,
	.dma_conf[RX_STREAM].head_block = &spi_stm32_dev_data_3.b[RX_STREAM][0],
#endif
};

DEVICE_AND_API_INIT(spi_stm32_3, DT_SPI_3_NAME, &spi_stm32_init,
		    &spi_stm32_dev_data_3, &spi_stm32_cfg_3,
		    POST_KERNEL, CONFIG_SPI_INIT_PRIORITY,
		    &api_funcs);

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_3(struct device *dev)
{
	IRQ_CONNECT(DT_SPI_3_IRQ, DT_SPI_3_IRQ_PRI,
		    spi_stm32_isr, DEVICE_GET(spi_stm32_3), 0);
	irq_enable(DT_SPI_3_IRQ);
}
#endif

#endif /* CONFIG_SPI_3 */

#ifdef CONFIG_SPI_4

