bluecats/zephyr/drivers/spi/spi_ll_stm32_preparation_for_blck_chained_dma.c
#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_4(struct device *port);
#endif

static const  struct spi_stm32_config spi_stm32_cfg_4 = {
	.spi = (SPI_TypeDef *) DT_SPI_4_BASE_ADDRESS,
	.pclken = {
		.enr = DT_SPI_4_CLOCK_BITS,
		.bus = DT_SPI_4_CLOCK_BUS
	},
#ifdef CONFIG_SPI_STM32_INTERRUPT
	.irq_config = spi_stm32_irq_config_func_4,
#endif

#ifdef CONFIG_SPI_STM32_DMA
	.stream[TX_STREAM] = 1,
	.stream[RX_STREAM] = 0,
	.dmadev = CONFIG_DMA_4_NAME,
#endif
};

static struct spi_stm32_data spi_stm32_dev_data_4 = {
	SPI_CONTEXT_INIT_LOCK(spi_stm32_dev_data_4, ctx),
	SPI_CONTEXT_INIT_SYNC(spi_stm32_dev_data_4, ctx),
#ifdef CONFIG_SPI_STM32_DMA
	// /* Transmit block config */
	// .b[TX_STREAM].dest_address = (u32_t)&(SPI4->DR),
	// .b[TX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[TX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	// /* Receive block config */
	// .b[RX_STREAM].source_address = (u32_t)&(SPI4->DR),
	// .b[RX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[RX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	/* Setup for transmit stream */
	.dma_conf[TX_STREAM].dma_slot = 0,
	.dma_conf[TX_STREAM].channel_direction = MEMORY_TO_PERIPHERAL,
	.dma_conf[TX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[TX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[TX_STREAM].source_burst_length = 0,
	.dma_conf[TX_STREAM].dest_burst_length = 0,
	.dma_conf[TX_STREAM].dma_callback = dmaCallback,
	.dma_conf[TX_STREAM].head_block = &spi_stm32_dev_data_4.b[TX_STREAM][0],

	/* Setup for receive stream */
	.dma_conf[RX_STREAM].dma_slot = 0,
	.dma_conf[RX_STREAM].channel_direction = PERIPHERAL_TO_MEMORY,
	.dma_conf[RX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[RX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[RX_STREAM].source_burst_length = 0,
	.dma_conf[RX_STREAM].dest_burst_length = 0,
	.dma_conf[RX_STREAM].dma_callback = dmaCallback,
	.dma_conf[RX_STREAM].head_block = &spi_stm32_dev_data_4.b[RX_STREAM][0],
#endif
};

DEVICE_AND_API_INIT(spi_stm32_4, DT_SPI_4_NAME, &spi_stm32_init,
		    &spi_stm32_dev_data_4, &spi_stm32_cfg_4,
		    POST_KERNEL, CONFIG_SPI_INIT_PRIORITY,
		    &api_funcs);

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_4(struct device *dev)
{
	IRQ_CONNECT(DT_SPI_4_IRQ, DT_SPI_4_IRQ_PRI,
		    spi_stm32_isr, DEVICE_GET(spi_stm32_4), 0);
	irq_enable(DT_SPI_4_IRQ);
}
#endif

#endif /* CONFIG_SPI_4 */

#ifdef CONFIG_SPI_5

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_5(struct device *port);
#endif

static const  struct spi_stm32_config spi_stm32_cfg_5 = {
	.spi = (SPI_TypeDef *) DT_SPI_5_BASE_ADDRESS,
	.pclken = {
		.enr = DT_SPI_5_CLOCK_BITS,
		.bus = DT_SPI_5_CLOCK_BUS
	},
#ifdef CONFIG_SPI_STM32_INTERRUPT
	.irq_config = spi_stm32_irq_config_func_5,
#endif

#ifdef CONFIG_SPI_STM32_DMA
	.stream[TX_STREAM] = 6,
	.stream[RX_STREAM] = 5,
	.dmadev = CONFIG_DMA_2_NAME,
#endif
};

static struct spi_stm32_data spi_stm32_dev_data_5 = {
	SPI_CONTEXT_INIT_LOCK(spi_stm32_dev_data_5, ctx),
	SPI_CONTEXT_INIT_SYNC(spi_stm32_dev_data_5, ctx),
#ifdef CONFIG_SPI_STM32_DMA
	// /* Transmit block config */
	// .b[TX_STREAM].dest_address = (u32_t)&(SPI5->DR),
	// .b[TX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[TX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	// /* Receive block config */
	// .b[RX_STREAM].source_address = (u32_t)&(SPI5->DR),
	// .b[RX_STREAM].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[RX_STREAM].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	/* Setup for transmit stream */
	.dma_conf[TX_STREAM].dma_slot = 0,
	.dma_conf[TX_STREAM].channel_direction = MEMORY_TO_PERIPHERAL,
	.dma_conf[TX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[TX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[TX_STREAM].source_burst_length = 0,
	.dma_conf[TX_STREAM].dest_burst_length = 0,
	.dma_conf[TX_STREAM].dma_callback = dmaCallback,
	.dma_conf[TX_STREAM].head_block = &spi_stm32_dev_data_5.b[TX_STREAM][0],

	/* Setup for receive stream */
	.dma_conf[RX_STREAM].dma_slot = 0,
	.dma_conf[RX_STREAM].channel_direction = PERIPHERAL_TO_MEMORY,
	.dma_conf[RX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[RX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[RX_STREAM].source_burst_length = 0,
	.dma_conf[RX_STREAM].dest_burst_length = 0,
	.dma_conf[RX_STREAM].dma_callback = dmaCallback,
	.dma_conf[RX_STREAM].head_block = &spi_stm32_dev_data_5.b[RX_STREAM][0],
#endif
};

DEVICE_AND_API_INIT(spi_stm32_5, DT_SPI_5_NAME, &spi_stm32_init,
		    &spi_stm32_dev_data_5, &spi_stm32_cfg_5,
		    POST_KERNEL, CONFIG_SPI_INIT_PRIORITY,
		    &api_funcs);

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_5(struct device *dev)
{
	IRQ_CONNECT(DT_SPI_5_IRQ, DT_SPI_5_IRQ_PRI,
		    spi_stm32_isr, DEVICE_GET(spi_stm32_5), 0);
	irq_enable(DT_SPI_5_IRQ);
}
#endif

#endif /* CONFIG_SPI_5 */

#ifdef CONFIG_SPI_6

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_6(struct device *port);
#endif

static const  struct spi_stm32_config spi_stm32_cfg_6 = {
	.spi = (SPI_TypeDef *) DT_SPI_6_BASE_ADDRESS,
	.pclken = {
		.enr = DT_SPI_6_CLOCK_BITS,
		.bus = DT_SPI_6_CLOCK_BUS
	},
#ifdef CONFIG_SPI_STM32_INTERRUPT
	.irq_config = spi_stm32_irq_config_func_6,
#endif
#ifdef CONFIG_SPI_STM32_DMA
	.stream[TX_STREAM] = 5,
	.stream[RX_STREAM] = 6,
	.dmadev = CONFIG_DMA_2_NAME,
#endif
};

static struct spi_stm32_data spi_stm32_dev_data_6 = {
	SPI_CONTEXT_INIT_LOCK(spi_stm32_dev_data_6, ctx),
	SPI_CONTEXT_INIT_SYNC(spi_stm32_dev_data_6, ctx),
#ifdef CONFIG_SPI_STM32_DMA
	/* Transmit block config */
	// .b[TX_STREAM][0].dest_address = (u32_t)&(SPI6->DR),
	// .b[TX_STREAM][0].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[TX_STREAM][0].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	// /* Receive block config */
	// .b[RX_STREAM][0].source_address = (u32_t)&(SPI6->DR),
	// .b[RX_STREAM][0].source_addr_adj = DMA_ADDR_ADJ_INCREMENT,
	// .b[RX_STREAM][0].dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE,

	/* Setup for transmit stream */
	.dma_conf[TX_STREAM].dma_slot = 0,
	.dma_conf[TX_STREAM].channel_direction = MEMORY_TO_PERIPHERAL,
	.dma_conf[TX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[TX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[TX_STREAM].source_burst_length = 0,
	.dma_conf[TX_STREAM].dest_burst_length = 0,
	.dma_conf[TX_STREAM].dma_callback = dmaCallback,
	.dma_conf[TX_STREAM].head_block = &spi_stm32_dev_data_6.b[TX_STREAM][0],

	/* Setup for receive stream */
	.dma_conf[RX_STREAM].dma_slot = 0,
	.dma_conf[RX_STREAM].channel_direction = PERIPHERAL_TO_MEMORY,
	.dma_conf[RX_STREAM].source_data_size = 0,      /* 8 bit data */
	.dma_conf[RX_STREAM].dest_data_size = 0,        /* 8 bit data */
	.dma_conf[RX_STREAM].source_burst_length = 0,
	.dma_conf[RX_STREAM].dest_burst_length = 0,
	.dma_conf[RX_STREAM].dma_callback = dmaCallback,
	.dma_conf[RX_STREAM].head_block = &spi_stm32_dev_data_6.b[RX_STREAM][0],
#endif
};

DEVICE_AND_API_INIT(spi_stm32_6, DT_SPI_6_NAME, &spi_stm32_init,
		    &spi_stm32_dev_data_6, &spi_stm32_cfg_6,
		    POST_KERNEL, CONFIG_SPI_INIT_PRIORITY,
		    &api_funcs);

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_irq_config_func_6(struct device *dev)
{
	IRQ_CONNECT(DT_SPI_6_IRQ, DT_SPI_6_IRQ_PRI,
		    spi_stm32_isr, DEVICE_GET(spi_stm32_6), 0);
	irq_enable(DT_SPI_6_IRQ);
}
#endif

#endif /* CONFIG_SPI_6 */
